templates_aph/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| APH Chamber CFD                                                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Background mesh must enclose APH: 454 x 408 x 501 mm. Margin ~ 10mm
// Cell size ~3.33 mm.
// x bounds: -0.01 to 0.464 -> 0.474m / 0.00333 ~ 142
// y bounds: -0.01 to 0.418 -> 0.428m / 0.00333 ~ 128
// z bounds: -0.01 to 0.511 -> 0.521m / 0.00333 ~ 156

scale   1;

vertices
(
    (-0.01 -0.01 -0.01)
    ( 0.464 -0.01 -0.01)
    ( 0.464  0.418 -0.01)
    (-0.01  0.418 -0.01)
    (-0.01 -0.01  0.511)
    ( 0.464 -0.01  0.511)
    ( 0.464  0.418  0.511)
    (-0.01  0.418  0.511)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (142 128 156) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
);

mergePatchPairs
(
);
