templates_aph/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| APH Chamber CFD -- turbulent kinetic energy                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.001;

boundaryField
{
    "(left_inlet|right_inlet)"
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.001;
    }

    "exhaust_.*"
    {
        type            inletOutlet;
        inletValue      uniform 0.001;
        value           uniform 0.001;
    }

    "(floor|walls|ceiling|carrier_tray)"
    {
        type            kqRWallFunction;
        value           uniform 0.001;
    }
}
